In [8]:
import pandas as pd
#import openpyxl

In [9]:
# Creating a DataFrame
data = {'Name': ["Simson", "Anna", "Peter", "Linda", "Maria", "Daniel", "Simon", "Monica"],
        'Age': [28, 25, 35, 32, 90, 42, 23, 16],
        'Country': ["Namibia", "South Africa", "USA", "Canada", "Nigeria", "Germany", "Germany", "Portugal"]}
df = pd.DataFrame(data)

In [10]:
# saving file as a csv file
df.to_csv("dataframe2.csv", index=False)

#df.to_excel("dataframe1.xlsx", engine="openpyxl")

### saving file as a .json file

In [11]:
df.to_json("dataframe.json")

### How to read files

In [12]:
pd.read_csv('dataframe.csv')

     Name  Age       Country
0  Simson   28       Namibia
1    Anna   25  South Africa
2   Peter   35           USA
3   Linda   32        Canada
4   Maria   90       Nigeria
5  Daniel   42       Germany
6   Simon   23       Germany
7  Monica   16      Portugal

### Saving file into database

-> Saving file into SQL Base file

In [13]:
import sqlite3 as sql

In [14]:
conn = sql.connect('pybase.db')

df.to_sql("people", conn)                                  
conn.close()